exp-3-merge-sort-final/src/runtime/web/experiment.org

#+TITLE:Merge sort experiment 
#+AUTHOR: VLEAD
#+DATE: [2017-06-21 WED]
#+SETUPFILE: ../../org-templates/level-2.org
#+TAGS: boilerplate(b)
#+EXCLUDE_TAGS: boilerplate
#+OPTIONS: ^:nil'

* Introduction
  This experiment demonstrates the merge sort in an interactice way using the notation of split and merge.
 


* Code and narration 
** Index HTML
*** HTML for the experiment
#+BEGIN_SRC  html :tangle templates/index.html :eval no :noweb yes
 <!doctype html>
<head>
<meta charset="utf-8">
<title>Dagre D3 Demo: Sentence Tokenization</title>

<link rel="stylesheet" href="demo.css">
<script src="http://d3js.org/d3.v3.min.js" charset="utf-8"></script>
<script src="../../../../../node_modules/dagre-d3/dist/dagre-d3.js"></script>

	
<style id="css">
/* This sets the color for "TK" nodes to a light blue green. */
g.type-TK > rect {
  fill: #00ffd0;
}

text {
  font-weight: 300;
  font-family: "Helvetica Neue", Helvetica, Arial, sans-serf;
  font-size: 14px;
}

.node rect {
  stroke: #999;
  fill: #fff;
  stroke-width: 1.5px;
}

.edgePath path {
  stroke: #333;
  stroke-width: 1.5px;
}
</style>
</head>
<body>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css">
  <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js"></script>
  <script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"></script>
</head>
<body>
<div class="jumbotron text-center">
  <h2>Merge Sort</h2>
</div>
#+END_SRC

#+BEGIN_SRC  html :tangle templates/index.html :eval no :noweb yes
<div class="form-group">
  <label for="arr" style="font-size:150%">Please enter the array to sort</label>
  <p>Please enter array with space separated integers!! </br></p>



<input type="text" id="arr" class="form-control" style="width:100%;font-size: 150%" >
  
</div>

<div>
<button type="button" id="but1" style="position:absolute;left:49%" class="btn btn-success btn-lg" onclick="helper()">Sort</button>
<button type="button" id="but2" style="position:absolute;left:60%" class="btn btn-success btn-lg" onclick="reset()">Reset</button>

</div>

<br><br><br/>

<svg id="svg-canvas" width=100% height=600 style="position: absolute;left:35%"></svg>



<script src="../static/js/merge.js"></script>
</body>


#+END_SRC

