exp-3-merge-sort-final/build/docs/runtime/web/experiment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Merge sort experiment</title>
<!-- 2017-08-29 Tue 09:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../../style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="../../style/css/override.css" />
<link rel="icon" type="image/png" href="../../style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Merge sort experiment</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Code and narration</a>
<ul>
<li><a href="#sec-2-1">2.1. Index HTML</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. HTML for the experiment</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. JS</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This experiment demonstrates the merge sort in an interactice way using the notation of split and merge.
</p>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Code and narration</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Index HTML</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> HTML for the experiment</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">

<pre class="src src-html"> &lt;<span style="font-weight: bold;">!doctype</span> html&gt;
&lt;<span style="font-weight: bold;">head</span>&gt;
&lt;<span style="font-weight: bold;">meta</span> <span style="font-weight: bold; font-style: italic;">charset</span>=<span style="font-style: italic;">"utf-8"</span>&gt;
&lt;<span style="font-weight: bold;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Dagre D3 Demo: Sentence Tokenization</span>&lt;/<span style="font-weight: bold;">title</span>&gt;

&lt;<span style="font-weight: bold;">link</span> <span style="font-weight: bold; font-style: italic;">rel</span>=<span style="font-style: italic;">"stylesheet"</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"demo.css"</span>&gt;
&lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"http://d3js.org/d3.v3.min.js"</span> <span style="font-weight: bold; font-style: italic;">charset</span>=<span style="font-style: italic;">"utf-8"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
&lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"../../../../../node_modules/dagre-d3/dist/dagre-d3.js"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;

        
&lt;<span style="font-weight: bold;">style</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"css"</span>&gt;
/* This sets the color for "TK" nodes to a light blue green. */
g.type-TK &gt; rect {
  fill: #00ffd0;
}

text {
  font-weight: 300;
  font-family: "Helvetica Neue", Helvetica, Arial, sans-serf;
  font-size: 14px;
}

.node rect {
  stroke: #999;
  fill: #fff;
  stroke-width: 1.5px;
}

.edgePath path {
  stroke: #333;
  stroke-width: 1.5px;
}
&lt;/<span style="font-weight: bold;">style</span>&gt;
&lt;/<span style="font-weight: bold;">head</span>&gt;
&lt;<span style="font-weight: bold;">body</span>&gt;
&lt;<span style="font-weight: bold;">link</span> <span style="font-weight: bold; font-style: italic;">rel</span>="stylesheet" <span style="font-weight: bold; font-style: italic;">href</span>="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css"&gt;
  &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>="https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js"&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
  &lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js"&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
&lt;/<span style="font-weight: bold;">head</span>&gt;
&lt;<span style="font-weight: bold;">body</span>&gt;
&lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>="jumbotron text-center"&gt;
  &lt;<span style="font-weight: bold;">h2</span>&gt;<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Merge Sort</span>&lt;/<span style="font-weight: bold;">h2</span>&gt;
&lt;/<span style="font-weight: bold;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="font-weight: bold;">div</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"form-group"</span>&gt;
  &lt;<span style="font-weight: bold;">label</span> <span style="font-weight: bold; font-style: italic;">for</span>=<span style="font-style: italic;">"arr"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"font-size:150%"</span>&gt;Please enter the array to sort&lt;/<span style="font-weight: bold;">label</span>&gt;
  &lt;<span style="font-weight: bold;">p</span>&gt;Please enter array with space separated integers!! &lt;/<span style="font-weight: bold;">br</span>&gt;&lt;/<span style="font-weight: bold;">p</span>&gt;



&lt;<span style="font-weight: bold;">input</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"text"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"arr"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"form-control"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"width:100%;font-size: 150%"</span> &gt;
  
&lt;/<span style="font-weight: bold;">div</span>&gt;

&lt;<span style="font-weight: bold;">div</span>&gt;
&lt;<span style="font-weight: bold;">button</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"button"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"but1"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"position:absolute;left:49%"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"btn btn-success btn-lg"</span> <span style="font-weight: bold; font-style: italic;">onclick</span>=<span style="font-style: italic;">"helper()"</span>&gt;Sort&lt;/<span style="font-weight: bold;">button</span>&gt;
&lt;<span style="font-weight: bold;">button</span> <span style="font-weight: bold; font-style: italic;">type</span>=<span style="font-style: italic;">"button"</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"but2"</span> <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"position:absolute;left:60%"</span> <span style="font-weight: bold; font-style: italic;">class</span>=<span style="font-style: italic;">"btn btn-success btn-lg"</span> <span style="font-weight: bold; font-style: italic;">onclick</span>=<span style="font-style: italic;">"reset()"</span>&gt;Reset&lt;/<span style="font-weight: bold;">button</span>&gt;

&lt;/<span style="font-weight: bold;">div</span>&gt;

&lt;<span style="font-weight: bold;">br</span>&gt;&lt;<span style="font-weight: bold;">br</span>&gt;&lt;<span style="font-weight: bold;">br</span>/&gt;

&lt;<span style="font-weight: bold;">svg</span> <span style="font-weight: bold; font-style: italic;">id</span>=<span style="font-style: italic;">"svg-canvas"</span> width=100% height=600 <span style="font-weight: bold; font-style: italic;">style</span>=<span style="font-style: italic;">"position: absolute;left:35%"</span>&gt;&lt;/<span style="font-weight: bold;">svg</span>&gt;



&lt;<span style="font-weight: bold;">script</span> <span style="font-weight: bold; font-style: italic;">src</span>=<span style="font-style: italic;">"../static/js/merge.js"</span>&gt;&lt;/<span style="font-weight: bold;">script</span>&gt;
&lt;/<span style="font-weight: bold;">body</span>&gt;
</pre>
</div>
</div>
</div>
</div>
