exp-3-merge-sort-final/build/docs/runtime/web/experiment.html

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> JS</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Reset and input functions
</li>
<li>Helper to call various functions
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Helper funtion to initiate function calls</span>

<span style="font-weight: bold; font-style: italic;">//  </span><span style="font-weight: bold; font-style: italic;">way of taking input , by default its space </span>

<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">reset</span>()
{
        g = <span style="font-weight: bold; text-decoration: underline;">null</span>
        g = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
        .setGraph({})
        .setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });
        ans=[]
        fin=0
        visited=[]
        mymap=<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Map</span>()
        <span style="font-weight: bold;">final</span>=[]
        document.getElementById(<span style="font-style: italic;">'svg-canvas'</span>).innerHTML = <span style="font-weight: bold; text-decoration: underline;">null</span>
        document.getElementById(<span style="font-style: italic;">'arr'</span>).value = <span style="font-weight: bold; text-decoration: underline;">null</span>
}




<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Helper funtion to initiate function calls</span>

<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">helper</span>()
{
        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Array to be sorted</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">array</span>=document.getElementById(<span style="font-style: italic;">'arr'</span>).value
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr</span>=array.split(<span style="font-style: italic;">" "</span>)
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">div</span>=mergeSort(arr,0)
        drawedge();
        draw();
}

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Global graph definition</span>

<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">g</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
.setGraph({})
.setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Set of global variables</span>

<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">ans</span>=[]
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">fin</span>=0
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">visited</span>=[]
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">mymap</span>=<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Map</span>()

<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Merge sort function</span>
</pre>
</div>
<ul class="org-ul">
<li>Global definition of the final graph.
</li>
<li>Global set of variables
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Global graph definition</span>

<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">g</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.graphlib.Graph</span>()
.setGraph({})
.setDefaultEdgeLabel(<span style="font-weight: bold;">function</span>() { <span style="font-weight: bold;">return</span> {}; });

<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Set of global variables</span>

<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">ans</span>=[]
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">fin</span>=0
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">visited</span>=[]
<span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">mymap</span>=<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Map</span>()
</pre>
</div>
<ul class="org-ul">
<li>Main Merge sort function.
</li>
<li>Nodes are also constructed with id and data
<ul class="org-ul">
<li>ID is marked by the 2*i &amp; 2*i+1 rule as evident in a binary tree.
</li>
<li>Data is unsorted arrays.
</li>
</ul>
</li>
<li>As total nodes are 2^n we also store this quantity for logical purposes.
</li>
<li>Also a map is made which maps- Node ID to Node data(array)
</li>
<li>Basic merge function which takes in two arrays and returns merged array  
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Merge sort function</span>
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">mergeSort</span>(<span style="font-weight: bold; font-style: italic;">arr</span>,<span style="font-weight: bold; font-style: italic;">count</span>)
{
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">lab</span>=arr.toString();
        
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Making a node in the graph for the current array string</span>
        g.setNode(count,{ label: lab,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span> });

        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Variable for storing maximum count of the node</span>
        fin=Math.max(fin,count)
        

        visited.push(count)
        
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Maping which node number contains which string array</span>
        mymap[count]=lab;
    
    <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Base case</span>
    <span style="font-weight: bold;">if</span> (arr.length &lt; 2)
    {   
      <span style="font-weight: bold;">return</span> arr;
    }

        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Merge sort</span>
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">middle</span> = parseInt(arr.length / 2);
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">left</span>   = arr.slice(0, middle);
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">right</span>  = arr.slice(middle, arr.length);
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(mergeSort(left,2*count+1),mergeSort(right,2*count+2));
 
    <span style="font-weight: bold;">return</span> temp;
    
}

<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Merge function of merge sort</span>
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">merge</span>(<span style="font-weight: bold; font-style: italic;">left</span>, <span style="font-weight: bold; font-style: italic;">right</span>)
{
    <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">result</span> = [];
 
    <span style="font-weight: bold;">while</span> (left.length &amp;&amp; right.length) {
        <span style="font-weight: bold;">if</span> (left[0] &lt;= right[0]) {
            result.push(left.shift());
        } <span style="font-weight: bold;">else</span> {
            result.push(right.shift());
        }
    }
 
    <span style="font-weight: bold;">while</span> (left.length)
        result.push(left.shift());
 
    <span style="font-weight: bold;">while</span> (right.length)
        result.push(right.shift());
 
    <span style="font-weight: bold;">return</span> result;
}
</pre>
</div>

<ul class="org-ul">
<li>Main function which renders the graph after we have added nodes and edges.
</li>
<li>Basic d3 selectors along with dagre.js syntax.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">function</span> <span style="font-weight: bold;">draw</span>()
{
        g.nodes().forEach(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">v</span>) 
        {
                 <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">node</span> = g.node(v);
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Round the corners of the nodes</span>
                node.rx = node.ry = 5;
        })

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Create the renderer</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">render</span> = <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">dagreD3.render</span>();

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Set up an SVG group so that we can translate the final graph.</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">svg</span> = d3.select(<span style="font-style: italic;">"svg"</span>),
        svgGroup = svg.append(<span style="font-style: italic;">"g"</span>);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Run the renderer. This is what draws the final graph.</span>
        render(d3.select(<span style="font-style: italic;">"svg g"</span>), g);

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Center the graph</span>
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">xCenterOffset</span> = (svg.attr(<span style="font-style: italic;">"width"</span>) - g.graph().width) / 2;
        svgGroup.attr(<span style="font-style: italic;">"transform"</span>, <span style="font-style: italic;">"translate("</span> + xCenterOffset + <span style="font-style: italic;">", 20)"</span>);
        svg.attr(<span style="font-style: italic;">"height"</span>, g.graph().height + 40);

}
</pre>
</div>

<ul class="org-ul">
<li>Funtion which connects individual components.
</li>
<li>Slightly complex logic - as nodes are not uniform but distributed among levels that too some levels partially filled.
</li>
<li>Main problem is generating 1st and 2nd levels of merge part manually then we can combne them using the same logic of binary merging.
</li>
<li>Comments are there to explain particular section of the code.

<ul class="org-ul">
<li>First part is to merge splitted nodes.
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript"><span style="font-weight: bold;">var</span> <span style="font-weight: bold;">final</span>=[]
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Fin contains 2^n that we had stored in merge sort function.</span>


<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Main function which connects the nodes in addition to forming merge nodes</span>
<span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Slightly complex logic</span>

<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">drawedge</span>()
{
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">count</span>=fin+1;
 
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">row</span>=parseInt((fin+2)/2);
        
        
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Connecting nodes between split nodes.</span>
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Connecting already present nodes with their children i.e. 2*i+1 &amp; 2*i+2</span>

        <span style="font-weight: bold;">for</span>(i=0;i&lt;=fin;i++)
        {
                        
                <span style="font-weight: bold;">if</span>(visited.indexOf(i)!=-1 &amp;&amp; visited.indexOf(2*i+1)!=-1 &amp;&amp; visited.indexOf(2*i+2)!=-1 )
                {
                        
                        g.setEdge(i,2*i+1,{label:<span style="font-style: italic;">"SPLIT"</span>});
                        g.setEdge(i,2*i+2,{label:<span style="font-style: italic;">"SPLIT"</span>});
                }
        }
</pre>
</div>
<ul class="org-ul">
<li>This part of the function will check and merge the last levels of the split segment manually.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">mid</span>=parseInt((fin)/2);
        
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Temp array will have nodes at last,2nd last and 3rd last levels which will be merged manually</span>

        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temparray</span>=[]

        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">This loop is for constructing the nodes of the first level of merge from the last level of split</span>

        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Mid is the starting index of the first element of the last row</span>

        <span style="font-weight: bold;">for</span>(i=mid;i&lt;=fin;i=i+2)
        {
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">If the node in present</span>

                <span style="font-weight: bold;">if</span>(visited.indexOf(i)!=-1)
                {
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[i];
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[i+1];
                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">arr1 and arr2 contains both the neighboring strings obtained using map </span>


                        tarr1=arr1.split(<span style="font-style: italic;">","</span>);
                        tarr2=arr2.split(<span style="font-style: italic;">","</span>);

                        tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                        tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                        
                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">tarr1 and tarr2 contains the final two neighbouring arrays</span>


                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);
                        
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
                        
                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Str contains the array converted to commar separated strings.</span>
                        
                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">syntax for making a new node with id as count and label as str</span>
                        
                        <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">Count is continued from fin i.e 2^n</span>
 
                        g.setNode(count,{ label: str,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span> });
                        mymap[count]=str;
                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Made the node and mapped it to its corresponding count</span>

                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">This array will be used in the subsequent loops</span>

                        temparray.push(count);

                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Made edges to this node</span>
                        g.setEdge(i,count,{label:<span style="font-style: italic;">"MERGE"</span>});
                        g.setEdge(i+1,count,{label:<span style="font-style: italic;">"MERGE"</span>});                        
                        
                        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">Increment the count for thr next node</span>
                        count=count+1;

                }

        }
</pre>
</div>
<ul class="org-ul">
<li>Similar to above one this will check for 2nd last level.
</li>
<li>2 cases
<ul class="org-ul">
<li>either the node has no neighbour =&gt; It has to merged with already new generated merge node from las level
</li>
<li>Both the neigbours are there =&gt; Both of them have to be merged.
</li>
</ul>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">        fin=mid;
        mid=(mid-1)/2;
        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">curr</span>=0
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">var final=[]</span>
        <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">This loop sees if their is any node in the 2nd last level such that they are not merged with neighbour or have one merge less</span>

        <span style="font-weight: bold;">for</span>(i=mid;i&lt;fin;i+=2)
        {
                <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">If both the neighbours have not been mapped i.e. They have no children</span>

                <span style="font-weight: bold;">if</span>(mymap[2*i+1]==<span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; mymap[2*i+2]==<span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; mymap[2*i+3]==<span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; mymap[2*i+4]==<span style="font-weight: bold; text-decoration: underline;">null</span> )
                {
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[i];
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[i+1];

                        
                        tarr1=arr1.split(<span style="font-style: italic;">""</span>);
                        tarr2=arr2.split(<span style="font-style: italic;">""</span>);
                        tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                        tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                        
                        
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);
                        
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
                        g.setNode(count,{ label: str,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span> });
                        mymap[count]=str;

                        <span style="font-weight: bold;">final</span>.push(count)
                        g.setEdge(i,count);
                        g.setEdge(i+1,count);

                        count=count+1;
                        
                }
                <span style="font-weight: bold; font-style: italic;">//</span><span style="font-weight: bold; font-style: italic;">If the neignour has children and this node has to be merged with the result of its children.</span>

                <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">if</span>(mymap[2*i+1]==<span style="font-weight: bold; text-decoration: underline;">null</span> &amp;&amp; mymap[2*i+2]==<span style="font-weight: bold; text-decoration: underline;">null</span>)
                {
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[i];
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[temparray[curr]];

                        
                        tarr1=arr1.split(<span style="font-style: italic;">","</span>);
                        tarr2=arr2.split(<span style="font-style: italic;">","</span>);
                        
                        tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                        tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})

                        
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);
                        
                        <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
                        g.setNode(count,{ label: str,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span> });
                        mymap[count]=str;
                        <span style="font-weight: bold;">final</span>.push(count)
                        g.setEdge(i,count,{label:<span style="font-style: italic;">"MERGE"</span>});
                        g.setEdge(temparray[curr],count,{label:<span style="font-style: italic;">"MERGE"</span>});
                        count=count+1;
                        curr=curr+1;
                }

        }
</pre>
</div>
<ul class="org-ul">
<li>This will merge temparray nodes one by one and add them to final array which will then be merged using binary logic.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">        <span style="font-weight: bold;">for</span>(i=curr;i&lt;temparray.length;i+=2)
        {
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[temparray[i]];
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[temparray[i+1]];
                

                tarr1=arr1.split(<span style="font-style: italic;">","</span>);
                tarr2=arr2.split(<span style="font-style: italic;">","</span>);
                
                
                tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})

                

                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);
        
               <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
                g.setNode(count,{ label: str,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span> });
                mymap[count]=str;
                <span style="font-weight: bold;">final</span>.push(count)
                g.setEdge(temparray[i],count,{label:<span style="font-style: italic;">"MERGE"</span>});
                g.setEdge(temparray[i+1],count,{label:<span style="font-style: italic;">"MERGE"</span>});
                count=count+1;
        }
</pre>
</div>

<ul class="org-ul">
<li>Final part which will merge the nodes using binary logic and stops when final array is empty.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-javascript">        <span style="font-weight: bold;">while</span>(1)
        {
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr1</span>=mymap[<span style="font-weight: bold;">final</span>[0]];
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">arr2</span>=mymap[<span style="font-weight: bold;">final</span>[1]];
                
        
                <span style="font-weight: bold;">if</span>(arr2 == <span style="font-weight: bold; text-decoration: underline;">null</span>)<span style="font-weight: bold;">break</span>;
                
                tarr1=arr1.split(<span style="font-style: italic;">","</span>);
                tarr2=arr2.split(<span style="font-style: italic;">","</span>);
                
                tarr1=tarr1.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})
                tarr2=tarr2.map(<span style="font-weight: bold;">function</span>(<span style="font-weight: bold; font-style: italic;">x</span>){<span style="font-weight: bold;">return</span> parseInt(x)})        
                
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">temp</span>=merge(tarr1,tarr2);
                <span style="font-weight: bold;">var</span> <span style="font-weight: bold; font-style: italic;">str</span>=temp.toString();
                
                g.setNode(count,{ label: str,<span style="font-weight: bold;">class</span>: <span style="font-style: italic;">"type-TOP"</span> });
                mymap[count]=str;
                <span style="font-weight: bold;">final</span>.push(count)
                g.setEdge(<span style="font-weight: bold;">final</span>[0],count,{label:<span style="font-style: italic;">"MERGE"</span>});
                g.setEdge(<span style="font-weight: bold;">final</span>[1],count,{label:<span style="font-style: italic;">"MERGE"</span>});
                
                count=count+1;
                <span style="font-weight: bold;">final</span>.splice(0,1);
                
                <span style="font-weight: bold;">final</span>.splice(0,1);
                

                <span style="font-weight: bold;">if</span>(<span style="font-weight: bold;">final</span>.length&lt;=1)<span style="font-weight: bold;">break</span>;

        }
        

}
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-06-21 WED]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-08-29 Tue 09:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
